balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP256GP502.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><edc:PIC xmlns:edc="http://crownking/edc" edc:arch="33xxxx" edc:desc="" edc:informedby="DOS" edc:isextended="false" edc:name="DSPIC33EP256GP502" edc:procid="0x01E6" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="DOS-01041.Module"/>
    <edc:Module_import edc:modsrc="DOS-00794.Module"/>
    <edc:Module_import edc:modsrc="DOS-00927.Module"/>
    <edc:Module_import edc:modsrc="DOS-00931.Module"/>
    <edc:Module_import edc:modsrc="DOS-00932.Module"/>
    <edc:Module_import edc:modsrc="DOS-00942.Module"/>
    <edc:Module_import edc:modsrc="DOS-00938.Module"/>
    <edc:Module_import edc:modsrc="DOS-00996.Module"/>
    <edc:Module_import edc:modsrc="DOS-00997.Module"/>
    <edc:Module_import edc:modsrc="DOS-00998.Module"/>
    <edc:Module_import edc:modsrc="DOS-00209.Module"/>
    <edc:Module_import edc:modsrc="DOS-01198.Module"/>
    <edc:Module_import edc:modsrc="DOS-01113.Module"/>
    <edc:Module_import edc:modsrc="DOS-00999.Module"/>
    <edc:Module_import edc:modsrc="DOS-01116.Module"/>
    <edc:Module_import edc:modsrc="DOS-00828.Module"/>
    <edc:Module_import edc:modsrc="DOS-00822.Module"/>
    <edc:Module_import edc:modsrc="DOS-01017-RPORx.Module"/>
    <edc:Module_import edc:modsrc="DOS-01017-RPINRx.Module"/>
    <edc:Module_import edc:modsrc="DOS-00892.Module"/>
    <edc:Module_import edc:modsrc="DOS-00804.Module"/>
    <edc:Module_import edc:modsrc="DOS-00826.Module"/>
    <edc:Module_import edc:modsrc="DOS-00933.Module"/>
    <edc:Module_import edc:modsrc="DOS-01080.Module"/>
    <edc:Module_import edc:modsrc="DOS-00929.Module"/>
    <edc:Module_import edc:modsrc="DOS-00958.Module"/>
    <edc:Module_import edc:modsrc="DOS-01117-PORTx.Module"/>
    <edc:Module_import edc:modsrc="DOS-01293.Module"/>
    <edc:Module_import edc:modsrc="DOS-01287-TLAC-PMDx.Module"/>
    <edc:Module_import edc:modsrc="DOS-01287_TLAC_INT_.Module"/>
    <edc:Module_import edc:modsrc="DOS-01424.Module"/>
    <edc:Module_import edc:modsrc="DOS-00995.Module"/>
    <edc:Module_import edc:modsrc="DOS-01332.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="1024" edc:haschecksum="true" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="2" edc:rowerase="128"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="33xxxx" edc:name="33xxxx">
    <edc:MemTraits edc:extendeddataspace="PIC24EP">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x02AFEA" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x02AFEA" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="HardTrapError" edc:desc="Generic Hard Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="DMACError" edc:desc="DMAC Error Trap vector"/>
    <edc:Trap edc:cname="SoftTrapError" edc:desc="Generic Soft Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Resereved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="Timer 1" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA0Interrupt" edc:desc="DMA Channel 0" edc:irq="4"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="Timer 2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="Timer 3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1 error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 transfer done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="AD1Interrupt" edc:desc="ADC1 Convert Done" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA1Interrupt" edc:desc="DMA Channel 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CM1Interrupt" edc:desc="Analog Comparator Combined Interrupt" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="DMA2Interrupt" edc:desc="DMA Channel 2" edc:irq="24"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="Timer 4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="Timer 5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2 error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 transfer done" edc:irq="33"/>
    <edc:Interrupt edc:cname="C1RxRdyInterrupt" edc:desc="ECAN1 Receive Data  Ready" edc:irq="34"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="ECAN1 Event" edc:irq="35"/>
    <edc:Interrupt edc:cname="DMA3Interrupt" edc:desc="DMA Channel 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC Generator Intrrupt" edc:irq="67"/>
    <edc:Interrupt edc:cname="C1TxReqInterrupt" edc:desc="ECAN1 Transmit Data Request" edc:irq="70"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="ICDInterrupt" edc:desc="ICD Application" edc:irq="142"/>
    <edc:Interrupt edc:cname="JTAGInterrupt" edc:desc="JTAG Programming" edc:irq="143"/>
    <edc:Interrupt edc:cname="PTGSTEPInterrupt" edc:desc="PTG STEP EVENT" edc:irq="145"/>
    <edc:Interrupt edc:cname="PTGWDTInterrupt" edc:desc="PTG Watchdog Time Out" edc:irq="146"/>
    <edc:Interrupt edc:cname="PTG0Interrupt" edc:desc="PTG Interrupt 0" edc:irq="147"/>
    <edc:Interrupt edc:cname="PTG1Interrupt" edc:desc="PTG Interrupt 1" edc:irq="148"/>
    <edc:Interrupt edc:cname="PTG2Interrupt" edc:desc="PTG Interrupt 2" edc:irq="149"/>
    <edc:Interrupt edc:cname="PTG3Interrupt" edc:desc="PTG Interrupt 3" edc:irq="150"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x2" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x800FF8" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x800FF8" edc:endaddr="0x801000" edc:regionid="userid">
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID0" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID0" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID0" edc:desc="" edc:mask="0xff" edc:name="UID0" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID1" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID1" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID1" edc:desc="" edc:mask="0xff" edc:name="UID1" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID2" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID2" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID2" edc:desc="" edc:mask="0xff" edc:name="UID2" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID3" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID3" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID3" edc:desc="" edc:mask="0xff" edc:name="UID3" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
